In [11]:
import numpy as np
import pandas as pd

In [12]:
sales = np.array([50, 30, 40, 25, 60])

In [18]:
product_info = pd.DataFrame({
    'Product': ['HP', 'Dell', 'Asus', 'Acer', 'Mac'],
    'Price': [20.0, 15.0, 25.0, 10.0, 30.0]
})

In [19]:
product_info

  Product  Price
0      HP   20.0
1    Dell   15.0
2    Asus   25.0
3    Acer   10.0
4     Mac   30.0

In [20]:
product_info['Sales'] = sales
product_info

  Product  Price  Sales
0      HP   20.0     50
1    Dell   15.0     30
2    Asus   25.0     40
3    Acer   10.0     25
4     Mac   30.0     60

In [22]:
product_info['Revenue'] = product_info['Sales'] * product_info['Price']

In [23]:
product_info

  Product  Price  Sales  Revenue
0      HP   20.0     50   1000.0
1    Dell   15.0     30    450.0
2    Asus   25.0     40   1000.0
3    Acer   10.0     25    250.0
4     Mac   30.0     60   1800.0